Revit 2027 API
ParameterTypeId.StructuralAttachmentTopType Property
 "Top Attachment Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentTopType { get; }
Public Shared ReadOnly Property StructuralAttachmentTopType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentTopType {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentTopType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace